import sys
arr = sorted(sys.argv[1])
arr2 = []
for i in range(len(arr)):
    if arr[i] not in arr2:
        arr2.append(arr[i])
print("".join(arr2))

# РЕШЕНИЕ ПРЕПОДАВАТЕЛЯ

# import sys

# # Получаем исходную строку.
# word = sys.argv[1]

# # Преобразовываем строку в множество.
# # Множество может содержать только уникальные значения,
# # а значит все дубли будут автоматически удалены. 
# symbols = set(word)

# # Преобразовывем множество в список, 
# # чтобы можно было использовать методы списков. 
# symbols = list(symbols)

# # Сортируем список в алфавитном порядке.
# symbols.sort()

# # Склеиваем элементы списка обратно в строку.
# print("".join(symbols))